string_list_A = [['"', 'aɪ', '_', 'm', 'iː', 'n', ',', '_', 'w', 'ɛ', 'ɹ', '_', 'ɪ', 'z', '_', 'j', 'ʊɹ', '_', 'h', 'aʊ', 's', '?', '"', '_', 'ɹ', 'ᵻ', 't', 'ɜː', 'n', 'd', '_', 'p', 'iː', 'ɾ', 'ɚ', '.'], ['ð', 'ə', '_', 's', 'ɪ', 'ŋ', 'ɪ', 'ŋ', '_', 'm', 'aʊ', 's', '_', 'k', 'eɪ', 'm', '_', 'aʊ', 't', '.'], ['d', 'ʌ', 'z', '_', 'ɛ', 'n', 'i', '_', 'w', 'ʌ', 'n', '_', 'ɛ', 'ɡ', 'z', 'æ', 'k', 't', 'l', 'i', '_', 'ʌ', 'n', 'd', 'ɚ', 's', 't', 'æ', 'n', 'd', '_', 'ð', 'ɛ', 'm', '?'], ['s', 'ɛ', 't', '_', 'ð', 'ə', '_', 'd', 'ɑː', 'ɡ', 'z', '_', 'æ', 'f', 't', 'ɚ', '_', 'ð', 'ɛ', 'm', '.'], ['θ', 'ɜː', 'ɾ', 'i', '_', 'w', 'ʌ', 'n', '.'], ['m', 'ɪ', 's', 'ɪ', 'z', '_', 'iː', 's', 't', 'm', 'ə', 'n', '_', 'l', 'ʊ', 'k', 't', '_', 'b', 'l', 'æ', 'ŋ', 'k', 'l', 'i', '_', 'æ', 't', '_', 'h', 'ɜː', '_', 's', 'ʌ', 'n', '.'], ['"', 'ð', 'ə', '_', 'm', 'ɪ', 'ɹ', 'ə', 'k', 'əl', '_', 'w', 'ʌ', 'z', ',', '_', 'ð', 'æ', 't', 'ð', 'ə', '_', 'w', 'ɜː', 'l', 'd', '_', 'w', 'ʊ', 'd', 'ə', 'n', 't', '_', 's', 'iː', '.'], ['w', 'ɪ', 'tʃ', '_', 'ʃ', 'oʊ', 'z', '_', 'w', 'ɛ', 'ɹ', 'ɪ', 'n', '_', 'p', 'ɜː', 's', 'ə', 'n', 'əl', '_', 'aɪ', 'd', 'ɛ', 'n', 't', 'ᵻ', 'ɾ', 'i', '_', 'k', 'ə', 'n', 's', 'ɪ', 's', 't', 's', '.'], ['n', 'aʊ', ',', '_', 'ɡ', 'ɛ', 't', '_', 'aʊ', 't', '_', 'j', 'ʊɹ', '_', 'p', 'æ', 'tʃ', 'w', 'ɜː', 'k', '_', 'æ', 'n', 'd', '_', 'h', 'æ', 'v', '_', 'j', 'ʊɹ', '_', 's', 'k', 'w', 'ɛɹ', '_', 'd', 'ʌ', 'n', '_', 'b', 'ᵻ', 'f', 'oːɹ', '_', 't', 'iː', 't', 'aɪ', 'm', '.', '"'], ['"', 'æ', 'n', 'dt', 'ə', 'b', 'i', '_', 's', 'ɪ', 'ɾ', 'ɪ', 'ŋ', '_', 'ɪ', 'n', '_', 'm', 'aɪ', '_', 'ɹ', 'uː', 'm', '_', 'ɪ', 'n', 'ð', 'ə', '_', 'd', 'ɑːɹ', 'k', '_', 't', 'uː', '!', '"'], ['k', 'ɑː', 'n', 't', 'ɹ', 'ə', 'd', 'ɪ', 'k', 'ʃ', 'ə', 'n', '_', 'h', 'iː', '_', 'w', 'ʊ', 'd', '_', 't', 'eɪ', 'k', '_', 'f', 'ɔːɹ', '_', 's', 'ɪ', 'm', 'p', 'əl', '_', 'ɑːɹ', 'ɡ', 'j', 'uː', 'm', 'ə', 'n', 't', '.'], ['"', 'm', 'æ', 'm', 'ə', '?'], ['n', 'ɑː', 't', '_', 'ð', 'ə', '_', 's', 'ʌ', 'b', 's', 't', 'ə', 'n', 's', '_', 'w', 'ɪ', 'ð', '_', 'w', 'ɪ', 'tʃ', '_', 'ð', 'ə', '_', 'k', 'ɑː', 'n', 'ʃ', 'ə', 's', 'n', 'ə', 's', '_', 'm', 'eɪ', '_', 'b', 'iː', '_', 'j', 'uː', 'n', 'aɪ', 'ɾ', 'ᵻ', 'd', '.'], ['"', 'ɔː', 'l', '_', 'ɹ', 'aɪ', 't', ',', '"', '_', 'θ', 'ɔː', 't', '_', 'ð', 'ə', '_', 'd', 'ɛ', 'v', 'əl', '.'], ['ɛ', 'n', 'i', '_', 'm', 'ɛ', 'm', 'b', 'ɚ', '_', 'h', 'æ', 'd', '_', 'ɐ', '_', 'ɹ', 'aɪ', 't', '_', 't', 'ə', '_', 'k', 'ɔː', 'l', '_', 'ɐ', '_', 'm', 'iː', 'ɾ', 'ɪ', 'ŋ', '.']]

# 从文件中读取字符串库  
with open('/mnt/zhijun/LibriTTS/data/vc_tokenized_16k_tfcodec/unique_text_tokens.k2symbols', 'r') as file:  
    string_library = file.read()  
  
# 将字符串库转换为字典  
string_library_dict = {}  
for line in string_library.strip().split('\n'):  
    key, value = line.split()  
    string_library_dict[key] = int(value)  
  
# 检查字符串列表A中的字符是否在字符串库中  
not_in_library = set()  
for string in string_list_A:  
    for ss in string:
        if ss not in string_library_dict.keys():  
            not_in_library.add(ss)  
  
print("字符不在字符串库中：", not_in_library)  
